/*
1. Пусть дан произвольный список целых чисел, удалить из него четные числа
2. Задан целочисленный список ArrayList.
Найти минимальное, максимальное и среднее арифметическое из этого списка. Collections.max()
3. Заполнить список названиями планет Солнечной системы в произвольном порядке с повторениями.
Вывести название каждой планеты и количество его повторений в списке 4.* Реализовать алгоритм сортировки слиянием
 */
public class Lesson_03HW_03 {
    public static void main(String[] args) {

    }
}
